
import UIKit



//: # 1️⃣ السؤال الاول
/*:

  ## ستقوم بعمل Function يقوم بحساب BMI
 
 #
1.1) قم بكتابة ثلاثة متغيرات
 #
 الأول يحتوي على قيمة الطول
 #الثاني عبارة عن الوزن
 #الثالث عبارة عن BMI
 
 #
 1.2)  قم بكتابة دالة تحتوي على معادلة لحساب الـ BMI
 #
 1.3) قم بكتابة داخل الدالة أمر Print لطباعة الـ BMI بعد حسابه.
 #
 تكون طريقه الطباعه باستمعال الif-Statment  لتحقيق الشروط الثالية
 #
 اقل من 18.5 -> ضعيف
 #
 18.5- 30.0 -> وزن طبيعي
 #
  30.1- 40.0 -> سمنة خفيفه
 #
 اكثر من 40 -> سمنة مفرطه
*/
var height = 156.0
var Weight = 44.6
var BMI =  2345.0

func numbers(h: Double , w: Double) -> Double{
    let result = h/w
    if result <= 18.5{
        print("ضعيف")
    }
    else if h <= 30.0 && w >= 18.5{
        print("وزن طبيعي")
    }
    else if result > 30.1 && result < 40.0{
        print("سمنة خفيفه")
    }
    else if h > 40 {
    print("سمنة مفرطه")
    
        
    }
    return result
    
}
numbers(h: 44.6, w: 156.3 )

//: # 2️⃣  السؤال الثاني

/*:
  ## سوف تقوم بعمل دالة تقوم بالكشف اذا كان المُتقدم يستحق رخصة القيادة أم لا.
##
2.1) قم بكتابة متغيرين الأول يرمز لأسم المتقدم و المتغير الثاني لعمر المتقدم.
 ##
 2.2) - قم بكتابة دالة تحتوي على parameters لإدخال اسم المتقدم و عمر المتقدم.
 ##
 2.3) قم بإنشاء If statement لمقارنة عمر المتقدم مع شروط التقديم
 ##
  #
 مثلًا اذا كان عمر المتقدم تحت ١٨ سوف يتم طباعة نص بأن المتقدم لم يكمل العُمر المطلوب
  #
 و اذا كان فوق ١٨ سوف يتم طباعة نص بأن المتقدم يُسمح له بإمتلاك رخصة قيادة
*/
func license(name: String  , age: Int){
    if age == 18{
        print("يسمح له بقياده \(name)")
    }
    else if age < 18{
        print("لا يسمح له بقياده \(name)")
    }
    else if age > 18{
        print("يقود \(name)")
    }
    
}
license(name: "ghanima", age: 15)
